Repository: Joncallim/macdown_2
Catalog: MacDown2/Packages/MacDownKit/Sources/JSONSupport/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ja, pl

source: Document exceeds the maximum nesting depth of %@.
fr: Le document dépasse la profondeur d'imbrication maximale de %@.
ja: 書類が最大ネスト深度%@を超えています。
pl: Dokument przekracza maksymalną głębokość zagnieżdżenia wynoszącą %@.

source: Duplicate object key '%@' (first defined at line %@).
fr: Clé d'objet dupliquée « %@ » (définie pour la première fois à la ligne %@).
ja: オブジェクトキー「%@」が重複しています(最初の定義は%@行目)。
pl: Zduplikowany klucz obiektu „%@” (po raz pierwszy zdefiniowany w wierszu %@).

source: Empty input: expected a JSON value.
fr: Entrée vide : une valeur JSON était attendue.
ja: 入力が空です: JSON値が必要です。
pl: Puste dane wejściowe: oczekiwano wartości JSON.

source: Expected ',' or ']' in array.
fr: « , » ou « ] » attendu dans le tableau.
ja: 配列内で「,」または「]」が必要です。
pl: Oczekiwano „,” lub „]” w tablicy.

source: Expected ',' or '}' in object.
fr: « , » ou « } » attendu dans l'objet.
ja: オブジェクト内で「,」または「}」が必要です。
pl: Oczekiwano „,” lub „}” w obiekcie.

source: Expected ':' after object key.
fr: « : » attendu après la clé d'objet.
ja: オブジェクトキーの後に「:」が必要です。
pl: Oczekiwano „:” po kluczu obiektu.

source: Expected a JSON value.
fr: Une valeur JSON était attendue.
ja: JSON値が必要です。
pl: Oczekiwano wartości JSON.

source: Expected a quoted object key.
fr: Une clé d'objet entre guillemets était attendue.
ja: 引用符で囲まれたオブジェクトキーが必要です。
pl: Oczekiwano klucza obiektu w cudzysłowie.

source: Invalid \u escape.
fr: Séquence d'échappement \u non valide.
ja: 無効な\uエスケープです。
pl: Nieprawidłowa sekwencja ucieczki \u.

source: Invalid escape sequence '\%@'.
fr: Séquence d'échappement « \%@ » non valide.
ja: 無効なエスケープシーケンス「\%@」です。
pl: Nieprawidłowa sekwencja ucieczki „\%@”.

source: Invalid literal: expected 'true', 'false', or 'null'.
fr: Littéral non valide : « true », « false » ou « null » attendu.
ja: 無効なリテラルです:「true」、「false」、または「null」が必要です。
pl: Nieprawidłowy literał: oczekiwano „true”, „false” lub „null”.

source: Invalid number: expected a digit after '.'.
fr: Nombre non valide : un chiffre était attendu après « . ».
ja: 無効な数値です:「.」の後に数字が必要です。
pl: Nieprawidłowa liczba: oczekiwano cyfry po „.”.

source: Invalid number: expected a digit in exponent.
fr: Nombre non valide : un chiffre était attendu dans l'exposant.
ja: 無効な数値です: 指数部に数字が必要です。
pl: Nieprawidłowa liczba: oczekiwano cyfry w wykładniku.

source: Invalid number: expected a digit.
fr: Nombre non valide : un chiffre était attendu.
ja: 無効な数値です: 数字が必要です。
pl: Nieprawidłowa liczba: oczekiwano cyfry.

source: Unescaped control character in string.
fr: Caractère de contrôle non échappé dans la chaîne.
ja: 文字列中にエスケープされていない制御文字があります。
pl: Nieukośnikowany znak sterujący w łańcuchu znaków.

source: Unexpected character while reading a JSON value.
fr: Caractère inattendu lors de la lecture d'une valeur JSON.
ja: JSON値の読み取り中に予期しない文字がありました。
pl: Nieoczekiwany znak podczas odczytu wartości JSON.

source: Unexpected content after the JSON value.
fr: Contenu inattendu après la valeur JSON.
ja: JSON値の後に予期しない内容があります。
pl: Nieoczekiwana zawartość po wartości JSON.

source: Unpaired surrogate in string.
fr: Substitut (surrogate) non apparié dans la chaîne.
ja: 文字列中にペアになっていないサロゲートがあります。
pl: Niesparowany znak zastępczy (surrogate) w łańcuchu znaków.

source: Unterminated array: expected ',' or ']'.
fr: Tableau non terminé : « , » ou « ] » attendu.
ja: 配列が終端されていません:「,」または「]」が必要です。
pl: Niezakończona tablica: oczekiwano „,” lub „]”.

source: Unterminated object: expected ',' or '}'.
fr: Objet non terminé : « , » ou « } » attendu.
ja: オブジェクトが終端されていません:「,」または「}」が必要です。
pl: Niezakończony obiekt: oczekiwano „,” lub „}”.

source: Unterminated string.
fr: Chaîne non terminée.
ja: 文字列が終端されていません。
pl: Niezakończony łańcuch znaków.

source: Unterminated string: dangling escape.
fr: Chaîne non terminée : séquence d'échappement incomplète.
ja: 文字列が終端されていません: エスケープシーケンスが不完全です。
pl: Niezakończony łańcuch znaków: nieukończona sekwencja ucieczki.
